Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: Furthermore, those revised layers are connected to specific stages in the content-development lifecycles introduced in this chapter and the ISTE standards for evaluating students as computational thinkers.
zh_cn: 此外，经过修订的抽象层级与本章介绍的内容开发生命周期中的特定阶段，以及评估学生计算机思维能力的ISTE标准息息相关。

source: Garcia explained abstraction as a foundational element in computational thinking with the following scenario:
zh_cn: 在下面的场景中，加西亚解释说明了抽象是计算思维的一个基本元素：

source: Gerald Cohen and Donald Cunningham, in the introduction to their 1984 book Creating Technical Manuals: A Step-by-Step Approach to Writing User-Friendly Instructions, already talked about a “crisis in manual writing.” According to these authors, manual readers in the 1980s were “more sophisticated and liberated” than those from before 1970 and would not “tolerate a poorly conceived manual.” Many of their recommendations urged the manual writer “to serve as an agent representing the reader.” One of the greatest failures of manual writing, they wrote, is “the lack of representation from the reader needs” (Cohen & Cunningham, 1984, p.13).
zh_cn: 杰拉德·柯亨（Gerald Cohen ）和唐纳德·坎宁安 （Donald Cunningham）在他们1984年出版的《创建技术手册：一步一步编写用户友好的操作说明》一书中就已经谈论过：“手册写作的危机。”根据这两位作者的说法，20世纪80年代手册读者比70年代以前的“更加成熟和自由”，不会“容忍构思拙劣的手册”。他们很多建议都要求手册作者应当“成为读者的代言人。”手册写作最大的失误之一在于写作“没能很好地代表读者需求” (Cohen & Cunningham, 1984, p.13).

source: Global collaborator
zh_cn: 全球合作者

source: Glossaries are rarely worth the effort.
zh_cn: 词汇表则不值得花太大功夫。

source: Going back to the Miller and Selzer taxonomy of topical conventions, that early work captured the generic structures of fixed types that included the classical DITA trio of concept, task, and reference.
zh_cn: 回到米勒和瑟尔泽对主题惯例的分类，早期工作抓住了固定类型的通用结构，其中包括经典DITA的三大支柱——概念、任务和引用。

source: Going back to the story of Chef Pedro from Chapter 1, a topic type from the base edition would look as Figure 2.2, which includes biographical information on Chef Pedro.
zh_cn: 回到 第一章中佩德罗的故事，基础版的主题类型跟表格 2.2很像，表格包含了佩德罗的传记信息。

source: Gone are the days when the manual was binding the academic and practitioner camps of technical communication as they worked towards the advancement of this common genre.
zh_cn: 以往技术传播领域的学术人士和从业者携手推动手册这一通用体裁的发展，进而两者绑定在一起，然而这样的日子已经一去不复返了。

source: Gretchen Hargis passed away in 2005, and the third edition of DQTI was published in 2014, with some of the second edition's co-authors.
zh_cn: 格雷琴·哈吉斯于2005年去世，而DQTI第三版于2014年，作者中也包含了第二版中的一部分人。

source: Gu & Pullman hypothesized that “a systems-based approach to content management may very well result in a devaluing of technical writers and editors and reduce their roles to those of assembly workers, where they are concerned only with producing discrete information chunks” (Gu & Pullman, 2009, p.
zh_cn: 古（Gu）和铂尔曼（Pullman）假设，“系统的内容管理方法可能会导致技术写作工程师和编辑的价值降低，使他们沦为和组装工人一样的角色，只需专注产出离散信息块” (Gu & Pullman, 2009, p.

source: Guzdial also sees disciplinary application as an essential step in assessing computational thinking.
zh_cn: 古齐亚尔还认为学科应用是评估计算机思维的必要一步。

source: HDITA
zh_cn: HDITA 格式

source: HDITA and MDITA
zh_cn: HDITA 和 MDITA 格式

source: HDITA is the authoring format of LwDITA that uses HTML5 to structure information.
zh_cn: HDITA是LwDITA的一种创作格式，它利用HTML5来构造信息。

source: HDITA, the paragraph element (<p> in both cases) can contain the following child elements:
zh_cn: HDITA， 段落 元素(在DITA和HTML中都是<p> )可以包含以下子元素：

source: HDITA, an HTML5 format that can be used for either authoring or displaying content
zh_cn: HDITA，一种可用于创作或展示内容的 HTML5 格式

source: HOW DITA EVOLVED INTO LwDITA
zh_cn: 从 DITA 到轻量级 DITA

source: HTML5 is only one of the many core transformations included in the DITA-OT.
zh_cn: HTML5只是众多包含在 DITA-OT 内的转换形式之一。

source: Hackos mentioned “an open source toolkit you can use to produce your own output in multiple media without having to invest in proprietary tools” (2011, p.
zh_cn: 哈克斯提到“有一个开源工具包，你可以使用它生成多种格式的文件，而不必购买专用软件”（2011年，第

source: Hackos summarizes the key benefits of DITA for technical communicators as follows:
zh_cn: 哈克斯总结了技术传播工程师使用 DITA 的益处：

source: Hargis also mentioned minimalism as a principle for writing technical information.
zh_cn: 哈吉斯同样将极简主义是为技术信息写作的一大原则。

source: Hargis specified that the quality characteristics were not presented as generic conventions or, as she called them, “elements”.
zh_cn: 哈吉斯指出，质量特征不是作为通用的惯例或她所说的“要素”来呈现的。

source: Having an understanding of the principles of authoring intelligent content with LwDITA, however, can benefit that lone writer in the
zh_cn: 不过了解使用 LwDITA 编写智能内容的原则有益无害，因为

source: Hayakawa & Hayakawa explain the concept of abstraction through the example of “Bessie the cow,” which is described in their influential work on semantics as a dynamic process (with respiratory, nervous, digestive and other systems “constantly changing”) and not just a static object.
zh_cn: Hayakawa 以贝西牛（Bessie the cow）为例解释了抽象概念，在他颇具影响力的语义学著作中，抽象概念被描述为一个动态过程（呼吸系统、神经系统、消化系统和其他系统都在“不断变化”），而不仅仅是一个静态对象。

source: He adds that demonstrating knowledge of computing is a necessary, but insufficient part of computational thinking assessment.
zh_cn: 他补充到：展示计算机知识是必要的，但这对于评估计算机思维来说还不够。

source: He described that as a problem of scaling: when there were a handful of important tech companies, their research and development departments could work closely with academics, and those partnerships were reciprocal.
zh_cn: 他将其描述成规模问题：当只存在少数几件重要的科技公司，并且其研发部门能够与学界密切合作时，他们之间存在互惠互利的关系。

source: He is comfortable with technology and social media, but he has never worked with any type of computer code.
zh_cn: 他熟悉各种科技和社交媒体，但从未接触过任何类型的计算机代码。

source: He is looking for a way to standardize the recipes used by his staff in the several kitchens he manages.
zh_cn: 他正在寻找一种方法来标准化员工使用的菜谱，菜谱来自于他管理的几家餐馆。

source: He proposes that students “must be applying, connecting, or transferring the computing knowledge to other domains to be computational thinking” (Guzdial, 2016a).
zh_cn: 他提出，学生“必须应用、迁移计算机知识到其他领域，融会贯通，才能形成计算机思维” (Guzdial, 2016a)。

source: He warned that creating online documentation generated new demand for skills in the technical writer's repertoire, including learning an authoring language or, “if you don't find an authoring language you enjoy,” collaborating with a programmer.
zh_cn: 他也警示创建在线文档会对技术文档工程师产生新的技能需求，其中包括学习一门创作语言或者，“如果你没有找到一门满意的创作语言”，就得与程序员通力合作。

source: Helping to make errors and error recovery less traumatic and more pedagogically productive (p.
zh_cn: 降低犯错与纠错的伤害，提升教学效率。(p.

source: Here I go back to the initial reaction of some authors that encounter this rule when they are introduced to LwDITA.
zh_cn: 再回到一些作者在接触LwDITA时遇到这个规则的初反应。

source: Highlighting Components (available in both topic and map)
zh_cn: 重点组件（话题和地图中都可以使用）

source: His WRA 420: Advanced Technical Writing course at Michigan State University had students using the DITA standard to structure and publish information more than a decade before I started writing this chapter.
zh_cn: 在我开始撰写本章的十多年前，他在密歇根州立大学WRA 420: 高级技术写作课程上让学生使用DITA标准来构造和发布信息。

source: How could content types created in XML, HTML5, and Markdown really speak the same language and represent established DITA conventions and structures?
zh_cn: 用 XML、HTML5 和 Markdown创建的内容类型如何能真正彼此兼容，并体现已建立的 DITA 规范和结构呢？

source: How does Carroll plead when facing the accusation of killing the manual?
zh_cn: 当卡罗尔面临杀死手册的指控时，她是如何自辩的？

source: However, DITA was born a heavy spec.
zh_cn: 然而，DITA生来就是一个庞杂的规范。

source: However, I do assume that readers from industry and academia will have a technological curiosity about content development in workflows that go beyond a word processor or a “What You See Is What You Get” (WYSIWYG) web editor.
zh_cn: 不过，我的确假定来自工业界和学术界的读者对工作流程中的内容开发充满技术上的好奇心，而我所指的工作流程可不仅仅是文字处理器或“所见即所得”（WYSIWYG）的网络编辑器。

source: However, as audiences and study participants were exposed to the possibility of creating DITA content without XML, many were replying with the same question: if we can use HTML5 to represent DITA topics and elements, can we use Markdown as well?
zh_cn: 然而，当用户和研究参与者了解到在不使用XML的情况下也可以创建 DITA 内容时，许多人发出了相同的疑问：如果我们可以使用 HTML5 来表示 DITA 话题和元素，是否也可以使用 Markdown ？

source: However, authors need to use software tools to create and process LwDITA content.
zh_cn: 但是，作者需要使用软件工具来创建和处理LwDITA内容。

source: However, automation doesn't just happen.
zh_cn: 然而，自动化并不是凭空而来的，

source: However, because HDITA files are valid HTML5 files, they can be opened in a web browser and produce an instant deliverable.
zh_cn: 不过因为 HDITA 文件是有效的 HTML5 文件，所以它们可以在网页浏览器中打开，并立刻生成可交付物。

source: However, before I talk about the specifics of the LwDITA map, I need to bring back the DITA map from Chapter 1.
zh_cn: 不过在介绍 LwDITA 地图的细节之前，我需要先谈谈第1章中的 DITA 地图。

source: However, in DQTI the quality requirements became “quality characteristics,” presented as a “system for editing and evaluating technical information” (Hargis, 1998, p.
zh_cn: 然而，在DQTI中，质量要求转换成“质量特征”，并以“技术信息编辑和评价系统”的形式出现。 (Hargis, 1998, p.

source: However, in contrast to desktop-publishing workflows, automating and formatting deliverables (topics that I will cover in future chapters) are not necessarily ice cream parties, but those are not routine tasks for most content authors.
zh_cn: 然而，与桌面发布工作流相比，自动化和格式化可交付成果(我将在以后的章节中讨论的主题)并不一定都能选用提前设定的冰淇淋风味，但对于大多数内容作者来说，这些并非常规任务。

source: However, many of its claims were based on an us-before-them trope, which included sentences like “Before you start your DITA project, train your writers in Information Mapping®,” or “Becoming familiar with Information Mapping® is a necessary first step towards a successful DITA implementation” (2011, p.
zh_cn: 然而，白皮书中许多声明是基于“先学信息映射®，再学 DITA”的论调，包括 “在开始 DITA 项目之前，训练写作者使用信息映射®”或“熟悉信息映射® 是成功迈向 DITA 实践不可或缺的第一步”（2011，第

source: However, one person's annoyance is another's enjoyment: Patrick Bosek, co-founder of the easyDITA component content management solution, once told me that, in his opinion, the “minimize mixed content” rule is one of the best features of XDITA.
zh_cn: 然而，甲之砒霜乙之蜜糖：easyDITA组件内容管理解决方案的联合创始人帕特里克·博塞克曾经告诉我，在他看来，“最小化混合内容”规则是XDITA的最佳特性之一。

source: However, recent approaches look at specific disciplinary applications.
zh_cn: 然而，最近的方法都着眼于特定学科的应用。

source: However, that mostly happened after me (at IBM).
zh_cn: 但事实是，DITA的开创是在我之后（即在IBM中发展起来的）。

source: However, that process of evolution is not necessarily transparent for authors who do not want or do not know how to edit XML schemas.
zh_cn: 然而，对于不想知道或者压根不知道如何编辑XML模式的作者而言，这一演进过程并非一眼就能看穿。

source: However, that step is not necessary for applying principles of computational thinking in technical communication from an author's perspective.
zh_cn: 然而从创作者的角度来看，如果在技术传播中应用计算机思维的原则的话，并不需要这一步。

source: However, the manual started to lose genre power in the 1980s and was on life support even before John Carroll delivered the final uppercut with the concept of minimalism.
zh_cn: 然而，20世纪80年代手册就开始失势，在约翰·卡罗尔带着极简主义理念给予致命一击前，手册就已经垂垂老矣。

source: However, the subcommittee did not find a champion to continue the work on JSON, and the proposed standard continued with three initial authoring formats: XDITA, HDITA, and MDITA.
zh_cn: 但是，小组委员会没有找到一个可以继续研究 JSON 的支持者，所以在提议的标准中，将继续使用最初的三种写作格式：XDITA、HDITA 和 MDITA。

source: However, the subcommittee finally decided to stay with Lightweight DITA, stylized in an acronym as LwDITA.
zh_cn: 但是小组委员会最终决定继续使用“轻量级DITA” （Lightweight DITA）这个名称，其缩写为 LwDITA。

source: However, their current format has already been approved by members of the DITA Technical Committee, and the general public, through our introductory committee note.
zh_cn: 但是，在介绍性的委员会文件《轻量级 DITA 简介》中，组件格式已经得到了 DITA 技术委员会成员和普通用户的认可。

source: However, they were loosely based on the College Board's AP Computer Science Principles “big ideas” (2017).
zh_cn: 不过，抽象层级受到了美国大学理事会开设计算机科学原理预修课程的“伟大思想”的些微影响 (2017)。

source: However, to put the three editions in context I include here some examples of representative topic types.
zh_cn: 为了将三种版本放到语境中观察，我列举了一些代表性的主题类型示例。

source: However, whereas a fully-developed lifecycle requires detailed planning and evaluation stages, the specific recommendations from Creating Intelligent Content with Lightweight DITA focus on the deficit in content-development training and education.
zh_cn: 但是一个成熟的生命周期需要详细的规划和合理的评估，而本书中的建议是多多关注内容开发培训和教育方面的不足。

source: However, “many of the pedagogical concerns of academic instructors in professional and technical communication have changed little over the past decade, even as practitioner discourse has continued to spin off in the direction of content strategy and similar areas” (Clark, 2016, p.
zh_cn: 然而，“在过去的十年里，即使技术传播从业者的讨论焦点继续在内容策略和类似领域的方向上发展，学术讲师在专业传播和技术传播中的许多教学关注点几乎没有变化”（克拉克，2016， 第

source: Human readers, however, still need to wait for a publishing process that will produce content deliverables that do not look like computer code.
zh_cn: 不过，人类读者仍然需要等待一个发布流程，通过发布可以生成看起来不像计算机代码的可交付内容。

source: I acknowledge that, as a whole, these chapters contain plenty of dense reference material, and I have attempted to include examples of the most common topical conventions available in LwDITA, with emphasis on frequent structures used by content creators.
zh_cn: 总的来说，这些章节包含了大量密集的参考材料，我试图使用 LwDITA 中最常见的话题规则来做展示，重点介绍内容创作者常用的结构。

source: I am a fan of using the same text for the topic identifier attribute and the file name: e.g., the @id of this topic is “franchise-intro,” and I would save it as franchise-intro.dita (XDITA topics can be saved with the file extensions .xml or .dita).
zh_cn: 我喜欢将话题标识符属性和文件名称设置为一样的内容：例如，此话题的 @id 是“franchise-intro”，我会将文件命名为 franchise-intro.dita（XDITA 格式的话题可以保存为扩展名为 .xml 或 .dita的文件）。

source: I am a voting member of the DITA Technical Committee with the Organization for the Adoption of Structured Information Standards (OASIS), which is currently working on version 2.0 of the standard; DITA's present and future are necessary for the lightweight approaches discussed in this book.
zh_cn: 我是 OASIS 的 DITA 技术委员会的投票成员，OASIS 目前正在制定 DITA 标准的2.0 版本，DITA 的现在和未来对于本书中讨论的轻量级方法都是非常重要的。

source: I am aware, though, that some large content repositories with diverse user groups do need a robust environment built on DITA XML, and that strong component of the standard is not going away.
zh_cn: 但是，我知道一些具有不同用户组的大型内容库确实需要基于XML 的 DITA 构建的健壮环境，这是 DITA 标准非常重要的一部分，不会就此消失。

source: I am not affiliated with Syncro Soft and my recommendation is based on Oxygen's relative affordability for academic audiences (compared with enterprise-level editors with similar capabilities) and their developers' genuine interest and attention for the development of LwDITA as an open standard.
zh_cn: 我并不隶属于Syncro-Soft，我推荐它是基于Oxygen对学术受众而言相对负担较轻（与具有类似功能的企业级编辑器相比），以及他们的开发人员是真心实意地对将LwDITA作为开放标准进行开发。

source: I argue that in a model of intelligent content with LwDITA built on principles of computational thinking, machine automation cannot happen without human abstraction.
zh_cn: 我认为，在基于计算机思维原则的LwDITA的智能内容模型中，如果没有人类的抽象能力，就没有机器自动化。

source: I assume that readers interested in LwDITA will already be at least slightly familiar with XML, HTML5, or Markdown.
zh_cn: 我假设对 LwDITA 感兴趣的读者至少已经稍微熟悉 XML、HTML5 或 Markdown 了。

source: I don't remember specifically talking about minimalism with him, but it was very much on my mind.
zh_cn: 我不记得自己有没有和他具体谈论过极简主义，但这个想法一直深植于我脑海中。

source: I don't think an information model did it.
zh_cn: 我并不认为是信息模型导致了这一结果。

source: I feel very strongly that when one opens a manual, the first printed page to fall to the eye should be a very general explanation of exactly what the system is, what problem it was intended to attack, and the reasons for bothering to attack that problem at all.
zh_cn: 我深信，人们打开手册时，引入眼帘的首页上应该是对系统概括性的精准描述、它可以辅助解决的问题以及解决这些问题的必要性。

source: I find it very flattering that anyone can think I can have that effect on anything.
zh_cn: 有人觉得我能具有如此的影响力，这实在让我倍感荣幸。

source: I had not interacted with Priestley before, although we followed each other on Twitter based on common friends and our shared interest on DITA, and one of my students conducting a research study had interviewed him in 2012 (and I incorporated some of his comments into my syllabus).
zh_cn: 虽然我和普里斯特利基于共同好友以及对 DITA 的共同兴趣在Twitter 上关注了彼此，但从未有过交流。2012 年，我的一个学生在进行一项研究时采访了他（我把他的一些评论写进了教学大纲)。

source: I had the opportunity to ask John Carroll what he thought of DITA, since many DITA people claim Carroll's minimalism as foundational to tech comm.
zh_cn: 我有幸询问约翰·卡罗尔对DITA的看法，许多DITA拥护者都将卡罗尔的极简主义是做技术传播的基石。

source: I have added a simple definition, sometimes redundant, to each generic convention, which I adapted from the LwDITA technical specification.
zh_cn: 我在每个通用协定中都添加了一个改编自《LwDITA 技术规范》的简单定义，虽然有时是这些定义多余的。

source: I have identified the intended audiences of this book as a) students and instructors who have been hesitant to learn about intelligent content and DITA because they see those as technologies alien to their work as scholars of writing, and b) practitioners who are interested in DITA or LwDITA from an author perspective and not necessarily as tools developers.
zh_cn: 我认为本书的目标读者有两类，一是一直在犹豫是否要学习智能内容开发和 DITA 的学生和教师，他们和研究写作的学者一样，认为这些技术与他们的工作格格不入，二是从写作的角度出发对 DITA 或 LwDITA 感兴趣的从业者，而不一定是工具开发人员。

source: I have mentioned a few times the definition of intelligent content provided by Rockley et al.
zh_cn: 之前我已经提过几次在《智能内容入门》一书中罗克利等人对智能内容的定义，

source: I have never yet used one that provided the explanation that I needed.
zh_cn: 我还没遇到哪个词汇表能够提供我需要的解释信息的。

source: I have organized this chapter according to the following classification of LwDITA content components:
zh_cn: 我按照以下对 LwDITA 内容组件的分类组织了本章内容：

source: I have seen colleagues in technical communication who value computational thinking and literacy as core skills of a college education and, as a result, send their students to take an introductory class in programming in a Computer Science department.
zh_cn: 我曾见过一些从事技术传播的同事，他们将计算机思维和读写能力视为大学教育的核心技能，因此，他们让学生去计算机科学院系上编程入门课程。

source: I honestly think it was much more a matter of a paradigm shift, a change in business model, changing populations, and the fact that the computer became a universal device instead of an elite device.
zh_cn: 老实说，我觉得它更多地是认知模式、商业模式、人口构成的转变，是由于电脑从精英设备转变成通用设备导致的结果。

source: I propose a sixth characteristic of rhetorical effectiveness.
zh_cn: 在此，我提出智能内容的修辞效果的第六个特性。

source: I provide background information and identify the intended audiences for the three initial authoring formats of the LwDITA proposed standard.
zh_cn: 我提供了LwDITA拟议标准的三种原始创作格式的背景信息并界定了目标受众。

source: I rarely get a second call and the conversation stays in the “someday/maybe” list.
zh_cn: 但是我很少再次接到他们的电话，谈话也都停留在“以后/可能”之词上。

source: I scheduled a follow-up call with Priestley, who invited Jenifer Schlotfeldt 一 Senior Content Strategist at IBM who was working on the Bluemix documentation project.
zh_cn: 我计划再与普里斯特利通次话，沟通后续问题，普里斯特利邀请了珍妮弗·斯洛特菲尔德IBM 高级内容策略师，参与了 Bluemix 文档项目）与我们一起交流。

source: I shared with them a small collection of HDITA sample topics that incorporated some of the elements from Priestley's blog post but added the possibility of content reuse and single-sourcing with new HTML5 custom data attributes.
zh_cn: 我与他们分享了一组 HDITA 话题示例，其中包含了普里斯特利博文提到的一些元素，同时使用了新的 HTML5 自定义数据属性，以增加实现内容复用和单一来源的可能性。

source: I told him that I would develop some sample topics in HDITA and, a term we created at that moment, “MarkDITA” 一 a Markdown-based authoring format of LwDITA.
zh_cn: 我告诉普里斯特利，我将开发一些 HDITA 和MarkDITA 话题示例。在我跟普里斯特利说话的那一刻，我们想到了“MarkDITA”这个名字，MarkDITA 是基于 Markdown 的 LwDITA 创作格式。

source: I tried to identify the technical communicator from the IBM lab in Raleigh who introduced Carroll to DITA.
zh_cn: 我试图确定IBM罗利实验室中将卡罗尔引向DITA的技术传播工程师究竟是谁。

source: I wanted to share my thoughts on how the lightweight model could be used to provide starting points for DITA users.
zh_cn: 我想与大家分享一下我对如何将轻量级模型作为 DITA 用户学习起点的看法。

source: I was leading IBM's production pilot of DITA in 2001/2, and I definitely had contact with him (Carroll) during that time.
zh_cn: 2001年2月我领导了IBM基于DITA的产品试点工作，那段时间我肯定同他（卡罗尔）有过接触。

source: I was surprised and gratified by how close the match was, and by how resilient and persistent those principles have proved.” That concept of applied minimalism is an undeniable engine behind the concept of intelligent content, which would not exist if authors were still writing print-based manuals with unstructured sections and chapters.
zh_cn: 让我尤为震惊和欣慰的是，用户指南和DITA配合的如此之好，这些原则的适应性和稳定性竟如此强大。”应用极简主义的的理念是推动智能内容发展的不二动力，但如若作者仍坚持撰写非结构化的篇章的印刷手册，这一动力就无法发挥效用。

source: I will describe those processing applications later in this chapter (and throughout the book).
zh_cn: 我将在本章后面的内容中（以及整本书）介绍这些处理软件。

source: I would argue that students working on an intelligent content workflow with LwDITA could fulfill many of those standards, but for the purpose of Creating Intelligent Content with Lightweight DITA I will focus on the “Computational thinker” standard.
zh_cn: 我认为能够使用 LwDITA 处理智能内容工作流的学生符合其中许多标准，但是基于本书写作目的，我将重点讨论“拥有计算机思维的思考者”。

source: I've been discussing this idea with several vendors and it seems to have traction.
zh_cn: 我已经和几个供应商讨论过这个想法，它似乎很吸引人。

source: IBM eventually donated DITA as an open standard, which is currently maintained by the non-profit consortium OASIS.
zh_cn: IBM 最终捐赠出 DITA，将其作为一种开放标准，目前该标准由非营利组织 OASIS 维护。

source: IM, developed by Robert Horn, is a methodology for structuring content that has been used in instructional technology, technical writing, and many other industries since the late 1960s.
zh_cn: IM 由罗伯特·霍恩（Robert Horn）开发，是一种构建内容的方法。自20世纪60年代末以来，IM已被用于教育技术、技术写作和许多其他领域。

source: ISTE specifies that the “Computational thinker” dimension could be assessed if “students develop and employ strategies for understanding and solving problems in ways that leverage the power of technological methods to develop and test solutions” (ISTE, 2018).
zh_cn: ISTE 规定，如果“学生能用技术的力量开发和测试解决方案，制定和实施策略以理解和解决问题“，就是 “拥有计算机思维的思考者” (ISTE, 2018)。

source: Identify its main functions and refer to an appropriate section later in the manual for detailed information.” “The complete introduction should not be more than 1—3 printed pages.
zh_cn: 界定它的主要功能，并指定手册后续章节以获取详细信息。”“完整的介绍不应超过1-3页。

source: If DITA was inspired by my work, then thank you.
zh_cn: 如果说DITA是受我启发而开创的，那么我想对你们的盛誉表示感谢。

source: If I have a manual, I am as good as the expert: I have the information and if I don't I have to call a help number and admit that someone else is in control.” But then he hammered in the last nail in the manual's coffin: “All this being said .
zh_cn: 如果我有手册在手，我就拥有了专家的水准：我掌握着相关信息，如果没有这些信息我就得打求助电话，并承认自己正处于他们的掌控之中。”但他给了手册最后致命一击：“尽管说了这么多，

source: If XML and DITA are still seen as new tools by academics when some practitioners are already labeling them as arcane, then we are just writing a new chapter in the documented gap between research and practice in the field (Andersen, 2013; Rude, 2015; Lauren & Pigg, 2016, and others).
zh_cn: 如果当从业者已经认为 DITA 和 XML 是过于复杂的技术之时，学术界仍将其视为新工具，那么我们是为技术传播研究和技术传播实践之间的文档差距写下了新的篇章（安德森，2013年；路德，2015年；劳伦和皮格，2016年等）。

source: If a sous-chef needs a printable PDF version of the recipe, Pedro can produce it without hiring a template designer (Figure 1.4).
zh_cn: 如果副厨师长需要一个可打印的 PDF 版本的菜谱，佩德罗可以自己制作生成，不需要聘请任何模板设计师（图1.4）。

source: If all Chef Pedro needed were a basic web version of the brochure, and if all the topics referenced in the map were also created in HDITA, this version of the map could provide the navigation structure for it.
zh_cn: 如果厨师佩德罗需要的只是一个简单的网页版宣传手册，并且地图中引用的所有话题都是由 HDITA 格式创建的，那么地图就可以提供导航结构。

source: If an author needs to include a definition list in MDITA, the recommendation is to take advantage of the MDITA extended profile and express the definition list with a raw code block of HDITA syntax.
zh_cn: 如果创作者需要在 MDITA 中使用定义列表，建议利用 MDITA 的扩展配置，并用 HDITA 语法的原始代码块表示定义列表。

source: If authors need more structure and their workflows require identifying a first paragraph as a short description, they should use the XDITA syntax instead.
zh_cn: 如果作者需要使用更多结构，并且其工作流需要将第一格段标识为简短描述的话，应该使用 XDITA 语法。
